Revit 2026 API

# RebarShapeParametersIsValidExternalDefinition Method

---

Checks that an ExternalDefinition (shared parameter) may be used as a Rebar Shape parameter.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidExternalDefinition(
	ExternalDefinition param
)
```
```vb
Public Shared Function IsValidExternalDefinition (
	param As ExternalDefinition
) As Boolean
```
```cpp
public:
static bool IsValidExternalDefinition(
	ExternalDefinition^ param
)
```
```fsharp
static member IsValidExternalDefinition :
        param : ExternalDefinition -> bool
```

#### Parameters

param ExternalDefinition
     Definition of a shared parameter.

#### Return Value

Boolean True if the definition is of type Length, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was |

A Rebar Shape parameter must be an ExternalDefinition with a ParameterType of Length.

#### Reference

RebarShapeParameters Class

Autodesk.Revit.DB.Structure Namespace